## 엑셀 파일 불러오기 (CSV)

In [1]:
import pandas as pd

In [4]:
CCTV_Seoul = pd.read_csv('C:/Users/has91/anaconda3/DataScience/data/01. CCTV_in_Seoul.csv')
CCTV_Seoul.head()

   기관명    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  2780       1292    430    584    932
1  강동구   773        379     99    155    377
2  강북구   748        369    120    138    204
3  강서구   884        388    258    184     81
4  관악구  1496        846    260    390    613

## 컬럼 이름 확인하기

In [6]:
CCTV_Seoul.columns

Index(['기관명', '소계', '2013년도 이전', '2014년', '2015년', '2016년'], dtype='object')

In [7]:
# 첫 번째 컬럼 이름 확인하기
CCTV_Seoul.columns[0]

'기관명'

## 컬럼 이름 바꾸기

In [8]:
CCTV_Seoul.rename(columns={CCTV_Seoul.columns[0] : "구별"}, inplace = True)
CCTV_Seoul.head()

    구별    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  2780       1292    430    584    932
1  강동구   773        379     99    155    377
2  강북구   748        369    120    138    204
3  강서구   884        388    258    184     81
4  관악구  1496        846    260    390    613

## 엑셀 파일 불러오기 (XLS)

In [9]:
pop_Seoul = pd.read_excel('C:/Users/has91/anaconda3/DataScience/data/01. population_in_Seoul.xls')
pop_Seoul.head()

,기간,자치구,세대,인구,인구.1,인구.2,인구.3,인구.4,인구.5,인구.6,인구.7,인구.8,세대당인구,65세이상고령자
0,기간,자치구,세대,합계,합계,합계,한국인,한국인,한국인,등록외국인,등록외국인,등록외국인,세대당인구,65세이상고령자
1,기간,자치구,세대,계,남자,여자,계,남자,여자,계,남자,여자,세대당인구,65세이상고령자
2,2017.1/4,합계,4202888,10197604,5000005,5197599,9926968,4871560,5055408,270636,128445,142191,2.36,1321458
3,2017.1/4,종로구,72654,162820,79675,83145,153589,75611,77978,9231,4064,5167,2.11,25425
4,2017.1/4,중구,59481,133240,65790,67450,124312,61656,62656,8928,4134,4794,2.09,20764

In [20]:
pop_Seoul = pd.read_excel('C:/Users/has91/anaconda3/DataScience/data/01. population_in_Seoul.xls',
                         header = 2,              # 세 번째 행 부터 읽기
                         usecols= 'B, D, G, J, N') # B, D, G, J, N 열만 읽기
pop_Seoul.head()

   자치구           계        계.1       계.2   65세이상고령자
0   합계  10197604.0  9926968.0  270636.0  1321458.0
1  종로구    162820.0   153589.0    9231.0    25425.0
2   중구    133240.0   124312.0    8928.0    20764.0
3  용산구    244203.0   229456.0   14747.0    36231.0
4  성동구    311244.0   303380.0    7864.0    39997.0

## pandas 기초 익히기

In [21]:
import pandas as pd
import numpy as np

In [22]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

### 날짜형 데이터 date_range

In [24]:
dates = pd.date_range('20130101', periods=6) # 20130101부터 6일 연속 날짜 데이터 생성
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [60]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=['A', 'B', 'C', 'D'])
df

                   A         B         C         D
2013-01-01 -2.618656  1.315755  1.002488 -0.977653
2013-01-02  0.318251  1.568763 -0.755831 -0.226142
2013-01-03  0.521327  0.494548 -0.838623 -0.664567
2013-01-04 -1.076885  0.569597 -0.683966  1.045350
2013-01-05  0.460987  0.405890 -0.406265  0.883810
2013-01-06  0.731504 -0.131471 -2.241671 -0.782207

In [27]:
df.index # 데이터프레임의 인덱스 확인하기

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [28]:
df.columns # 데이터프레임의 컬럼 확인하기

Index(['A', 'B', 'C', 'D'], dtype='object')

In [29]:
df.values # 데이터프레임의 값 확인하기

array([[-1.21653836e-03,  1.14333645e+00,  2.08554291e+00,
        -3.15922442e-01],
       [ 1.13899668e+00,  2.01069328e-01, -1.22575102e-01,
         1.68303672e+00],
       [ 7.25301334e-01,  2.29264904e+00, -4.33326717e-02,
        -8.00906582e-02],
       [ 2.54238093e-02, -1.20679112e+00, -7.58259831e-01,
        -8.47640432e-01],
       [ 1.04278994e+00,  2.21723367e+00, -6.33750048e-01,
        -3.69027999e-01],
       [ 2.68989259e+00,  6.76930004e-01, -3.01625923e-02,
         8.79633013e-01]])

In [36]:
df.info() # 데이터프레임의 개요 확인하기

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       6 non-null      float64
 1   B       6 non-null      float64
 2   C       6 non-null      float64
 3   D       6 non-null      float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [37]:
df.describe() # # 데이터프레임의 통계적 개요

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.936865  0.887405  0.082910  0.158331
std    0.987994  1.319823  1.029821  0.939878
min   -0.001217 -1.206791 -0.758260 -0.847640
25%    0.200393  0.320034 -0.505956 -0.355752
50%    0.884046  0.910133 -0.082954 -0.198007
75%    1.114945  1.948759 -0.033455  0.639702
max    2.689893  2.292649  2.085543  1.683037

In [38]:
df.sort_values(by = 'B', ascending = False) # by로 지정된 컬럼으로 정렬

                   A         B         C         D
2013-01-03  0.725301  2.292649 -0.043333 -0.080091
2013-01-05  1.042790  2.217234 -0.633750 -0.369028
2013-01-01 -0.001217  1.143336  2.085543 -0.315922
2013-01-06  2.689893  0.676930 -0.030163  0.879633
2013-01-02  1.138997  0.201069 -0.122575  1.683037
2013-01-04  0.025424 -1.206791 -0.758260 -0.847640

In [39]:
df['A'] # df 데이터프레임의 'A' 열만 출력

2013-01-01   -0.001217
2013-01-02    1.138997
2013-01-03    0.725301
2013-01-04    0.025424
2013-01-05    1.042790
2013-01-06    2.689893
Freq: D, Name: A, dtype: float64

In [41]:
df[0:3] # 0~2 행만 출력

                   A         B         C         D
2013-01-01 -0.001217  1.143336  2.085543 -0.315922
2013-01-02  1.138997  0.201069 -0.122575  1.683037
2013-01-03  0.725301  2.292649 -0.043333 -0.080091

In [42]:
df['20130102':'20130104'] # 20130102 ~ 20130104 까지 출력

                   A         B         C         D
2013-01-02  1.138997  0.201069 -0.122575  1.683037
2013-01-03  0.725301  2.292649 -0.043333 -0.080091
2013-01-04  0.025424 -1.206791 -0.758260 -0.847640

### loc

In [43]:
df.loc[dates[0]] # dates[0] = '20130101'

A   -0.001217
B    1.143336
C    2.085543
D   -0.315922
Name: 2013-01-01 00:00:00, dtype: float64

In [45]:
df.loc[:,['A' , 'B']] # df의 모든 행 , A , B 열만 출력

                   A         B
2013-01-01 -0.001217  1.143336
2013-01-02  1.138997  0.201069
2013-01-03  0.725301  2.292649
2013-01-04  0.025424 -1.206791
2013-01-05  1.042790  2.217234
2013-01-06  2.689893  0.676930

In [46]:
df.loc['20130102':'20130104', ['A' , 'B']]

                   A         B
2013-01-02  1.138997  0.201069
2013-01-03  0.725301  2.292649
2013-01-04  0.025424 -1.206791

In [47]:
df.loc[dates[0], 'A']

-0.0012165383582470077

### iloc

In [49]:
df.iloc[3] # 3번행만 출력

A    0.025424
B   -1.206791
C   -0.758260
D   -0.847640
Name: 2013-01-04 00:00:00, dtype: float64

In [50]:
df.iloc[3:5, 0:2] # 3, 4번 행, 0, 1번 열 출력

                   A         B
2013-01-04  0.025424 -1.206791
2013-01-05  1.042790  2.217234

In [52]:
df.iloc[[1, 2, 4], [0, 2]] # 행, 열 지정하여 출력

                   A         C
2013-01-02  1.138997 -0.122575
2013-01-03  0.725301 -0.043333
2013-01-05  1.042790 -0.633750

In [53]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02  1.138997  0.201069 -0.122575  1.683037
2013-01-03  0.725301  2.292649 -0.043333 -0.080091

In [54]:
df.iloc[:, 1:3]

                   B         C
2013-01-01  1.143336  2.085543
2013-01-02  0.201069 -0.122575
2013-01-03  2.292649 -0.043333
2013-01-04 -1.206791 -0.758260
2013-01-05  2.217234 -0.633750
2013-01-06  0.676930 -0.030163

## 조건문

In [74]:
df[df.A > 0] # df의 A열이 0보다 큰 행만 출력

                   A         B         C         D
2013-01-02  0.318251  1.568763 -0.755831 -0.226142
2013-01-03  0.521327  0.494548 -0.838623 -0.664567
2013-01-05  0.460987  0.405890 -0.406265  0.883810
2013-01-06  0.731504 -0.131471 -2.241671 -0.782207

In [57]:
df[df > 0] # 0보다 큰 값만 출력(나머지는 NaN)

                   A         B         C         D
2013-01-01       NaN  1.143336  2.085543       NaN
2013-01-02  1.138997  0.201069       NaN  1.683037
2013-01-03  0.725301  2.292649       NaN       NaN
2013-01-04  0.025424       NaN       NaN       NaN
2013-01-05  1.042790  2.217234       NaN       NaN
2013-01-06  2.689893  0.676930       NaN  0.879633

## 데이터 프레임 복사

In [62]:
df2 = df.copy() # 데이터 위치 복사(데이터의 내용까지 복사하라는 지령 copy())
df2

                   A         B         C         D
2013-01-01 -2.618656  1.315755  1.002488 -0.977653
2013-01-02  0.318251  1.568763 -0.755831 -0.226142
2013-01-03  0.521327  0.494548 -0.838623 -0.664567
2013-01-04 -1.076885  0.569597 -0.683966  1.045350
2013-01-05  0.460987  0.405890 -0.406265  0.883810
2013-01-06  0.731504 -0.131471 -2.241671 -0.782207

## 열 생성

In [66]:
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
df2

                   A         B         C         D      E
2013-01-01 -2.618656  1.315755  1.002488 -0.977653    one
2013-01-02  0.318251  1.568763 -0.755831 -0.226142    one
2013-01-03  0.521327  0.494548 -0.838623 -0.664567    two
2013-01-04 -1.076885  0.569597 -0.683966  1.045350  three
2013-01-05  0.460987  0.405890 -0.406265  0.883810   four
2013-01-06  0.731504 -0.131471 -2.241671 -0.782207  three

In [68]:
df2['E'].isin(['two', 'four']) # two, four이 있는지 조건 (boolean)

2013-01-01    False
2013-01-02    False
2013-01-03     True
2013-01-04    False
2013-01-05     True
2013-01-06    False
Freq: D, Name: E, dtype: bool

In [69]:
df[df2['E'].isin(['two', 'four'])] # two, four만 출력

                   A         B         C         D
2013-01-03  0.521327  0.494548 -0.838623 -0.664567
2013-01-05  0.460987  0.405890 -0.406265  0.883810

In [70]:
df

                   A         B         C         D
2013-01-01 -2.618656  1.315755  1.002488 -0.977653
2013-01-02  0.318251  1.568763 -0.755831 -0.226142
2013-01-03  0.521327  0.494548 -0.838623 -0.664567
2013-01-04 -1.076885  0.569597 -0.683966  1.045350
2013-01-05  0.460987  0.405890 -0.406265  0.883810
2013-01-06  0.731504 -0.131471 -2.241671 -0.782207

## 누적합 np.cumsum

In [72]:
df.apply(np.cumsum)

                   A         B         C         D
2013-01-01 -2.618656  1.315755  1.002488 -0.977653
2013-01-02 -2.300405  2.884517  0.246657 -1.203795
2013-01-03 -1.779078  3.379065 -0.591966 -1.868362
2013-01-04 -2.855963  3.948662 -1.275932 -0.823012
2013-01-05 -2.394976  4.354552 -1.682197  0.060798
2013-01-06 -1.663472  4.223081 -3.923868 -0.721409

## 최댓값과 최솟값의 차이

In [73]:
df.apply(lambda x: x.max() -x.min())

A    3.350160
B    1.700233
C    3.244159
D    2.023003
dtype: float64